
# Задача: написать цикл "у нас столько то денег" пока деньги есть, отнимать 1, когда деньги закончаться, вывести
# Задача: написать простейшую валидацию на проверку пароля

password = '123'
print('какой пароль?')
password = input()
while password != '123':
    print('fail. try again:')
    password = input()
print('yes right ')





